latex/settheory/SetTheory.tex
% Created 2019-12-11 三 15:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\input{preamble.tex}
\author{Qi'ao Chen}
\date{\today}
\title{Notes on Set Theory}
\hypersetup{
 pdfauthor={Qi'ao Chen},
 pdftitle={Notes on Set Theory},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents \clearpage
\section{Foreword}
\label{sec:org01ba3a1}
Notes for the entrance examination
\section{Models of Set - Sertraline}
\label{sec:orgc0ac8f5}
\subsection{Some mathematical logic}
\label{sec:orgf00f0b7}
\begin{theorem}[Gödel’s second incompleteness theorem]
If a consistent recursive axiom set \(T\) contains \(\zfc\), then
\begin{equation*}
T\not\vdash\con(t)
\end{equation*}
especially, \(\zfc\not\vdash\con(\zfc)\)
\end{theorem}

\begin{definition}[]
Suppose \((M,E_M)\) and \((N,E_N)\) are two models of set theory, then
\begin{enumerate}
\item if for any formula \(\sigma\), \(M\models\sigma\) if and only if
\(N\models\sigma\), then \(M\) and \(N\) are \tf{elementary equivalent}, denoted
by \(M\equiv N\)
\item If bijection \(f:M\to N\) satisfies: for any \(a,b\in M\), \(aE_Mb\) iff
\(f(a)E_Nf(b)\), then \(f:M\cong N\) is an \tf{isomorphism}
\item If \(M\subseteq N\) and \(E_M=E_N\restriction M\), then \(M\) is \(N\)'s submodel
\item If \(M\) is isomorphic to a submodel of \(N\) by injection \(f\), and for any
formula \(\varphi(x_1,\dots,x_n)\), for any \(a_1,\dots,a_n\in M\), 
\(M\models\varphi[a_1,\dots,a_n]\) iff
\(N\models\varphi[f(a_1),\dots,f(a_n)]\), then \(f\) is called an
\tf{elementary embedding} from \(M\) to \(N\), written as \(f:M\prec N\)
\item If \(M\subseteq N\) and \(M\prec N\), then \(M\) is a \tf{elementary submodel}
of \(N\)
\end{enumerate}
\end{definition}

\begin{lemma}[]
Suppose \(N\models\zfc,M\subseteq N\), then \(M\prec N\) iff
\(\forall\varphi(x,x_1,\dots,x_n)\), \(\forall(a_1,\dots,a_n)\in M\), if 
\(\exists a\in N\) s.t. \(N\models\varphi[a,a_1,\dots,a_n]\), then \(\exists a\in
  M\) s.t. 
\(M\models\varphi[a,a_1,\dots,a_n]\)
\end{lemma}

\begin{definition}[]
Suppose \((M,E)\models\zfc\)
\begin{enumerate}
\item \(h_\varphi:M^n\to M\) is \(\varphi\)'s \tf{Skolem function} if 
\(\forall a_1,\dots,a_n\in M\), if \(\exists a\in M\) s.t.
\(M\models\varphi[a,a_1,\dots,a_n]\), then
\(M\models\varphi[h_\varphi(a_1,\dots,a_n),a_1,\dots,a_n]\) . requires \ac
\item Let \(\calh=\{h_\varphi\mid\varphi \text{is a formula on set theory}\}\). For
any \(S\subseteq M\), \tf{Skolem hull} \(\calh(S)\) is the smallest set
consisting of \(S\) and closed under \(\calh\)
\end{enumerate}
\end{definition}

\begin{lemma}[]
\(N\models\zfc,S\subseteq N\), if \(M=\calh(S)\), then \(M\prec N\)
\end{lemma}

\begin{theorem}[Löwenheim-Skolem theorem]
Suppose \(N\models\zfc\) and is infinite, then there is a model \(M\) s.t.
\(\abs{M}=\omega\) and \(M\prec N\)
\end{theorem}
\subsection{Cumulative Hierarchy}
\label{sec:org7cea4f1}
This section works in \zfm(a.k.a. \(\zf-\text{axiom of foundation}\))

\begin{definition}[]
For any \(\alpha\), define sequence \(V_\alpha\)
\begin{enumerate}
\item \(V_0=\emptyset\)
\item \(V_{\alpha+1}=\calp(V_\alpha)\)
\item For any limit ordinal \(\lambda\), \(V_\lambda=\bigcup_{\beta<\lambda}V_\beta\)
\end{enumerate}


And \(\wf=\displaystyle\bigcup_{\alpha\in\on}V_\alpha\)
\end{definition}

\begin{lemma}[]
For any ordinal \(\alpha\)
\begin{enumerate}
\item \(V_\alpha\) is transitive
\item if \(\xi\le\alpha\), then \(V_\xi\subseteq V_\alpha\)
\item if \(\kappa\) is inaccessible cardinal, then \(\abs{V_\kappa}=\kappa\)
\end{enumerate}
\end{lemma}

\begin{proof}
\begin{enumerate}
\item Obviously \(\kappa\le V_\kappa\). Since \(\kappa\) is inaccessible, then for any
\(\alpha<\kappa\), \(\abs{V_\alpha}<\kappa\).
\end{enumerate}
\end{proof}

\begin{definition}[]
For any set \(x\in\wf\), 
\begin{equation*}
\rank(x)=\min\{\beta\mid x\in V_{\beta+1}\}
\end{equation*}
\end{definition}

\begin{lemma}[]
\begin{enumerate}
\item \(V_\alpha=\{x\in\wf\mid\rank(x)<\alpha\}\)
\item \wf is transitive
\item For any \(x,y\in\wf\), if \(x\in y\), then \(\rank(x)<\rank(y)\)
\item for any \(y\in\wf\), \(\rank(y)=\sup\{\rank(x)+1\mid x\in y\}\)
\end{enumerate}
\end{lemma}

\begin{lemma}[]
Supoose \(\alpha\) is an ordinal
\begin{enumerate}
\item \(\alpha\in\wf\) and \(\rank(\alpha)=\alpha\)
\item \(V_\alpha\cap\on=\alpha\)
\end{enumerate}
\end{lemma}

\begin{lemma}[]
\begin{enumerate}
\item If \(x\in\wf\), then \(\bigcup x,\calp(x),\{x\}\in\wf\), and their ranks are
all less than \(\rank(x)+\omega\)
\item If \(x,y\in\wf\), then \(x\times y,x\cup y,x\cap y,\{x,y\},(x,y),x^y\in\wf\),
and their ranks are all less than \(\rank(x)+\rank(y)+\omega\)
\item \(\Z,\Q,\R\in V_{\omega+\omega}\)
\item for any set \(x\), \(x\in\wf\) iff \(x\subset\wf\)
\end{enumerate}
\end{lemma}

\begin{lemma}[]
Suppose \ac
\begin{enumerate}
\item for any group \(G\), there exists group \(G'\cong G\) in \wf
\item for any topological space \(T\), there exists \(T'\cong T\) in \wf
\end{enumerate}
\end{lemma}

\begin{definition}[]
Binary relation \(<\) on set \(A\) is \tf{well-founded} if for any nonempty
\(X\subseteq A\), \(X\) has minimal element under \(<\)
\end{definition}


\begin{theorem}[]
If \(A\in\wf\), then \(\in\) is a well-founded relation on \(A\)
\end{theorem}

\begin{lemma}[]
If set \(A\) is transitive and \(\in\) is well-founded on \(A\), then \(A\in\wf\)
\end{lemma}

\begin{lemma}[]
For any set \(x\), there is a smallest transitive set \(\trcl{x}\) s.t.
\(x\subseteq\trcl{x}\) 
\end{lemma}

\begin{proof}
\begin{align*}
x_0&=x\\
x_{n+1}&=\bigcup x_n\\
\trcl{x}&=\displaystyle\bigcup_{n<\omega}x_n
\end{align*}
\end{proof}

\(\trcl{x}\) is called \tf{transitive closure} of \(x\)


\begin{lemma}[]
Without axiom of power set
\begin{enumerate}
\item if \(x\) is transitive, then \(\trcl{x}=x\)
\item if \(y\in x\), then \(\trcl{y}\subseteq\trcl{x}\)
\item \(\trcl{x}=x\cup\bigcup\{\trcl{y}\mid y\in x\}\)
\end{enumerate}
\end{lemma}

\begin{theorem}[]
For any set \(X\), the following are equivalent
\begin{enumerate}
\item \(X\in\wf\)
\item \(\trcl{X}\in\wf\)
\item \(\in\) is a well-founded relation on \(\trcl{X}\)
\end{enumerate}
\end{theorem}

\begin{theorem}[]
The following propositions are equivalent
\begin{enumerate}
\item Axiom of foundation
\item For any set \(X\), \(\in\) is a well-founded relation on \(X\)
\item \(\tf{V}=\wf\)
\end{enumerate}
\end{theorem}
