books/settheory.org
** Relativization
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   Let \tf{M} be a class \varphi a formula, the \tf{relativization} of \varphi
   to \tf{M} is $\varphi^{\tf{M}}$ defined inductively
   \begin{align*}
   (x\in y)^{\cm}&\leftrightarrow x=y\\
   (x\in y)^{\cm}&\leftrightarrow x\in y\\
   (\varphi\to\psi)^{\cm}&\leftrightarrow \varphi^{\cm}\to\psi^\cm\\
   (\neg\varphi)^\cm&\leftrightarrow\neg\varphi^\cm\\
   (\forall x\varphi)^\cm&\leftrightarrow(\forall x\in\cm)\varphi^\cm
   \end{align*}
   #+END_definition

   Note $\varphi^\cv=\varphi$ and
   \begin{equation*}
   f^\cm=\{(x_1,\dots,x_n,x_{n+1})\in\cm\mid\varphi^\cm(x_1,\dots,x_n,x_{n+1})\}
   \end{equation*}

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   For any theory $T$, any class $\cm$, $\cm\models T$ iff for any axiom
   $\varphi$ of $T$, $\varphi^\cm$ holds
   #+END_definition


   #+ATTR_LATEX: :options [\zfm]
   #+BEGIN_theorem
   $\wf\models\zf$
   #+END_theorem

   #+BEGIN_proof
   * \tf{Axiom of existence}

     $(\exists x(x=x))^\cm\leftrightarrow\exists x\in\cm(x=x)$, which is
     equivalent to \cm being nonempty
   * \tf{Axiom of extensionality}

     \begin{gather*}
     \forall X\forall Y\forall u((u\in X\leftrightarrow u\in Y)\to X=Y)^\cm
     \Leftrightarrow\\
     \forall X\in\cm\forall Y\in\cm\forall u\in\cm
     ((u\in X\leftrightarrow u\in Y)\to X=Y)
     \end{gather*}

     \begin{lemma}
     If $\cm$ is transitive, then axiom of extensionality holds in \cm
     \end{lemma}

   * \tf{Axiom schema of specification}

     \begin{equation*}
     \forall X\in\cm\exists Y\in\cm\forall u\in\cm(u\in Y\leftrightarrow
     u\in X\wedge\varphi^\cm(u))
     \end{equation*}

     Since for any $X\in\wf$, $\calp(X)\subseteq \wf$
   * \tf{Axiom of paring}
   * \tf{Axiom of union}
   * \tf{Axiom of power set}

     \begin{equation*}
     \forall X\in\cm\exists Y\in\cm\forall u\in\cm(u\in Y\leftrightarrow(u\subseteq X)^\cm)
     \end{equation*}
     and 
     \begin{equation*}
     (u\subseteq X)^\cm\leftrightarrow\forall x\in\cm(x\in u\to x\in X)
     \leftrightarrow u\cap\cm\subseteq X
     \end{equation*}
   * \tf{Axiom of foundation}
   * \tf{Axiom schema of replacement}
   #+END_proof 
** Absoluteness
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   For any formula $\psi(x_1,\dots,x_n)$ and any class \cm,\cn, 
   $\cm\subseteq \cn$, if
   \begin{equation*}
   \forall x_1\dots\forall x_n\in\cm(\psi^\cm(x_1,\dots,x_n)
   \leftrightarrow\psi^\cn(x_1,\dots,x_n))
   \end{equation*}
   then $\psi(x_1,\dots,x_n)$ is \tf{absolute} for \cm,cn. If $\cn=\cv$, then
   \psi is \tf{absolute} for \cm
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   Suppose $\cm\subseteq\cn$ and \varphi,\psi are formulas, then
   1. if \varphi,\psi are absolute for \cm,cn, then so are
      $\neg\varphi,\varphi\to\psi$ 
   2. if \varphi doesn't contain any quantifiers, then \varphi is absolute for
      any \cm
   3. if \cm,\cn  are transitive and \varphi is absolute for them, then so are
      $\forall x\in y\varphi$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   $\Delta_0$ formula
   1. $x=y,x\in y$ are $\Delta_0$ formulas
   2. if \varphi,\psi are $\Delta_0$, then so are $\neg\varphi,\varphi\to\psi$
   3. if $\varphi$ is $\Delta_0$, $y$ is any set, then $(\forall x\in y)\varphi$
      is $\Delta_0$
      

   If \varphi is $\Delta_0$, then $\exists x_1\dots\exists x_n\varphi$ is
   $\Sigma_1$ formula, $\forall x_1\dots\forall x_n\varphi$ is $\Pi_1$
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   $\cm\subseteq\cn$ are both transitive, $\psi(x_0,\dots,x_n)$ is a formula,
   then
   1. if \psi is $\Delta_0$, then it's absolute for \cm,cn
   2. if \psi is $\Sigma_1$, then
      \begin{equation*}
      \forall x_1\dots x_n(\psi^\cm(x_1,\dots,x_n)\to\psi^\cn(x_1,\dots,x_n))
      \end{equation*}
   3. if \psi is $\Pi_1$, then
      \begin{equation*}
      \forall x_1\dots x_n(\psi^\cn(x_1,\dots,x_n)\to\psi^\cm(x_1,\dots,x_n))
      \end{equation*}
   #+END_lemma
   
   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If $\cm\subseteq\cn$, $\cm\models\Sigma,\cn\models\Sigma$ and
   \begin{equation*}
   \Sigma\vdash\forall x_1\dots\forall x_n(\varphi(x_1,\dots,x_n)\leftrightarrow
   \psi(x_1,\dots,x_n))
   \end{equation*}
   then \varphi is absolute for \cm,\cn if and only if \psi is absolute for \cm,\cn
   #+END_lemma


   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   Suppose $\cm\subseteq\cn$, $f(x_1,\dots,x_n)$ is a function. $f$ is
   \tf{absolute} for \cm and \cn if and only if $\varphi(x_1,\dots,x_n,x_{n+1})$
   defining $f$ is absolute.
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   Following relations and functions can be defined in
   $\zfmm-\text{Pow}-\text{Inf}$ and are equivalent to some $\Delta_0$ formulas.
   So they are absolute for any transitive model \cm on 
   $\zfmm-\text{Pow}-\text{Inf}$
   1. $x\in y$
   2. $x=y$
   3. $x\subset y$
   4. $\{x,y\}$
   5. $\{x\}$

   6. $(x,y)$
   7. $\emptyset$
   8. $x\cup y$
   9. $x-y$
   10. $x\cap y$
   11. $x^+$
   12. $x$ is a transitive set
   13. $\bigcup x$
   14. $\bigcap x$ ($\bigcap\emptyset=\emptyset$)
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   Absoluteness is closed under operation composition
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   Following relations and functions are absolute for any transitive model \cm on 
   $\zfmm-\text{Pow}-\text{Inf}$
   1. $z$ is an ordered pair
   2. $A\times B$
   3. $R$ is a relation
   4. $\dom{R}$
   5. $\ran{R}$
   6. $f$ is a function
   7. $f(x)$
   8. $f$ is injective
   #+END_theorem
** Relative consistence of the axiom of foundation
   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   Suppose transitive class $\cm\models\zfmm-\text{Pow}-\text{inf}$ and
   $\omega\in\cm$, then the axiom of infinity is true in \cm. Hence the axiom of
   infinity is true in \wf
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   label:7.5.2
   Let $T$ be a theory of set theory language and \Sigma a set of sentences.
   Suppose \cm is a class and $T\vdash\cm\neq\emptyset$, then if
   $\cm\models_T\Sigma$, then
   1. for any sentences \varphi, if $\Sigma\vdash\varphi$, then
      $T\vdash\varphi^\cm$
   2. if $T$ is consistent, then so is $\text{Cn}(\Sigma)$
   #+END_theorem


   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   The axiom of foundation is consistent with \zfm.
   #+END_theorem

   #+BEGIN_proof
   By ref:7.5.2, let T be \zfm, \Sigma be \zf and \cm be \wf
   #+END_proof

   #+ATTR_LATEX: :options [$\zfmm$]
   #+BEGIN_lemma
   Suppose transitive model $\cmm\models\zfmm-\text{Pow}-\text{Inf}$. If
   $X,R\in\cm$ and $R$ is a well-order on $X$, then
   \begin{equation*}
   (R\text{ is a well-order on }X)^\cmm
   \end{equation*}
   #+END_lemma

   #+ATTR_LATEX: :options [$\zfmm$]
   #+BEGIN_theorem
   $V_\omega\models\zfc-\text{Inf}+\neg\text{Inf}$
   #+END_theorem
   #+BEGIN_proof
   For any $X\in V_\omega$, $X$ is finite hence there is a well-ordering on $X$
   #+END_proof

   \begin{corollary}
   $\con{\zfmm}\to\con{\zfc-\text{Inf}+\neg\text{Inf}}$
   \end{corollary}
