latex/settheory/SetTheory.tex
\subsection{Relativization}
\label{sec:orgc9d325d}
\begin{definition}[]
Let \tf{M} be a class \(\varphi\) a formula, the \tf{relativization} of \(\varphi\)
to \tf{M} is \(\varphi^{\tf{M}}\) defined inductively
\begin{align*}
(x\in y)^{\cm}&\leftrightarrow x=y\\
(x\in y)^{\cm}&\leftrightarrow x\in y\\
(\varphi\to\psi)^{\cm}&\leftrightarrow \varphi^{\cm}\to\psi^\cm\\
(\neg\varphi)^\cm&\leftrightarrow\neg\varphi^\cm\\
(\forall x\varphi)^\cm&\leftrightarrow(\forall x\in\cm)\varphi^\cm
\end{align*}
\end{definition}

Note \(\varphi^\cv=\varphi\) and
\begin{equation*}
f^\cm=\{(x_1,\dots,x_n,x_{n+1})\in\cm\mid\varphi^\cm(x_1,\dots,x_n,x_{n+1})\}
\end{equation*}

\begin{definition}[]
For any theory \(T\), any class \(\cm\), \(\cm\models T\) iff for any axiom
\(\varphi\) of \(T\), \(\varphi^\cm\) holds
\end{definition}


\begin{theorem}[\zfm]
\(\wf\models\zf\)
\end{theorem}

\begin{proof}
\begin{itemize}
\item \tf{Axiom of existence}

\((\exists x(x=x))^\cm\leftrightarrow\exists x\in\cm(x=x)\), which is
equivalent to \cm being nonempty
\item \tf{Axiom of extensionality}

\begin{gather*}
\forall X\forall Y\forall u((u\in X\leftrightarrow u\in Y)\to X=Y)^\cm
\Leftrightarrow\\
\forall X\in\cm\forall Y\in\cm\forall u\in\cm
((u\in X\leftrightarrow u\in Y)\to X=Y)
\end{gather*}

\begin{lemma}
If $\cm$ is transitive, then axiom of extensionality holds in \cm
\end{lemma}

\item \tf{Axiom schema of specification}

\begin{equation*}
\forall X\in\cm\exists Y\in\cm\forall u\in\cm(u\in Y\leftrightarrow
u\in X\wedge\varphi^\cm(u))
\end{equation*}

Since for any \(X\in\wf\), \(\calp(X)\subseteq \wf\)
\item \tf{Axiom of paring}
\item \tf{Axiom of union}
\item \tf{Axiom of power set}

\begin{equation*}
\forall X\in\cm\exists Y\in\cm\forall u\in\cm(u\in Y\leftrightarrow(u\subseteq X)^\cm)
\end{equation*}
and 
\begin{equation*}
(u\subseteq X)^\cm\leftrightarrow\forall x\in\cm(x\in u\to x\in X)
\leftrightarrow u\cap\cm\subseteq X
\end{equation*}
\item \tf{Axiom of foundation}
\item \tf{Axiom schema of replacement}
\end{itemize}
\end{proof}
\subsection{Absoluteness}
\label{sec:org6bdb381}
\begin{definition}[]
For any formula \(\psi(x_1,\dots,x_n)\) and any class \cm,\cn, 
\(\cm\subseteq \cn\), if
\begin{equation*}
\forall x_1\dots\forall x_n\in\cm(\psi^\cm(x_1,\dots,x_n)
\leftrightarrow\psi^\cn(x_1,\dots,x_n))
\end{equation*}
then \(\psi(x_1,\dots,x_n)\) is \tf{absolute} for \cm,cn. If \(\cn=\cv\), then
\(\psi\) is \tf{absolute} for \cm
\end{definition}

\begin{lemma}[]
Suppose \(\cm\subseteq\cn\) and \(\varphi\),\(\psi\) are formulas, then
\begin{enumerate}
\item if \(\varphi\),\(\psi\) are absolute for \cm,cn, then so are
\(\neg\varphi,\varphi\to\psi\)
\item if \(\varphi\) doesn't contain any quantifiers, then \(\varphi\) is absolute for
any \cm
\item if \cm,\cn  are transitive and \(\varphi\) is absolute for them, then so are
\(\forall x\in y\varphi\)
\end{enumerate}
\end{lemma}

\begin{definition}[]
\(\Delta_0\) formula
\begin{enumerate}
\item \(x=y,x\in y\) are \(\Delta_0\) formulas
\item if \(\varphi\),\(\psi\) are \(\Delta_0\), then so are \(\neg\varphi,\varphi\to\psi\)
\item if \(\varphi\) is \(\Delta_0\), \(y\) is any set, then \((\forall x\in y)\varphi\)
is \(\Delta_0\)
\end{enumerate}


If \(\varphi\) is \(\Delta_0\), then \(\exists x_1\dots\exists x_n\varphi\) is
\(\Sigma_1\) formula, \(\forall x_1\dots\forall x_n\varphi\) is \(\Pi_1\)
\end{definition}

\begin{lemma}[]
\(\cm\subseteq\cn\) are both transitive, \(\psi(x_0,\dots,x_n)\) is a formula,
then
\begin{enumerate}
\item if \(\psi\) is \(\Delta_0\), then it's absolute for \cm,cn
\item if \(\psi\) is \(\Sigma_1\), then
\begin{equation*}
\forall x_1\dots x_n(\psi^\cm(x_1,\dots,x_n)\to\psi^\cn(x_1,\dots,x_n))
\end{equation*}
\item if \(\psi\) is \(\Pi_1\), then
\begin{equation*}
\forall x_1\dots x_n(\psi^\cn(x_1,\dots,x_n)\to\psi^\cm(x_1,\dots,x_n))
\end{equation*}
\end{enumerate}
\end{lemma}

\begin{lemma}[]
If \(\cm\subseteq\cn\), \(\cm\models\Sigma,\cn\models\Sigma\) and
\begin{equation*}
\Sigma\vdash\forall x_1\dots\forall x_n(\varphi(x_1,\dots,x_n)\leftrightarrow
\psi(x_1,\dots,x_n))
\end{equation*}
then \(\varphi\) is absolute for \cm,\cn if and only if \(\psi\) is absolute for \cm,\cn
\end{lemma}


\begin{definition}[]
Suppose \(\cm\subseteq\cn\), \(f(x_1,\dots,x_n)\) is a function. \(f\) is
\tf{absolute} for \cm and \cn if and only if \(\varphi(x_1,\dots,x_n,x_{n+1})\)
defining \(f\) is absolute.
\end{definition}

\begin{theorem}[]
Following relations and functions can be defined in
\(\zfmm-\text{Pow}-\text{Inf}\) and are equivalent to some \(\Delta_0\) formulas.
So they are absolute for any transitive model \cm on 
\(\zfmm-\text{Pow}-\text{Inf}\)
\begin{enumerate}
\item \(x\in y\)
\item \(x=y\)
\item \(x\subset y\)
\item \(\{x,y\}\)
\item \(\{x\}\)

\item \((x,y)\)
\item \(\emptyset\)
\item \(x\cup y\)
\item \(x-y\)
\item \(x\cap y\)
\item \(x^+\)
\item \(x\) is a transitive set
\item \(\bigcup x\)
\item \(\bigcap x\) (\(\bigcap\emptyset=\emptyset\))
\end{enumerate}
\end{theorem}

\begin{lemma}[]
Absoluteness is closed under operation composition
\end{lemma}

\begin{theorem}[]
Following relations and functions are absolute for any transitive model \cm on 
\(\zfmm-\text{Pow}-\text{Inf}\)
\begin{enumerate}
\item \(z\) is an ordered pair
\item \(A\times B\)
\item \(R\) is a relation
\item \(\dom{R}\)
\item \(\ran{R}\)
\item \(f\) is a function
\item \(f(x)\)
\item \(f\) is injective
\end{enumerate}
\end{theorem}
\subsection{Relative consistence of the axiom of foundation}
\label{sec:org37dc5d6}
\begin{lemma}[]
Suppose transitive class \(\cm\models\zfmm-\text{Pow}-\text{inf}\) and
\(\omega\in\cm\), then the axiom of infinity is true in \cm. Hence the axiom of
infinity is true in \wf
\end{lemma}

\begin{theorem}[]
\label{7.5.2}
Let \(T\) be a theory of set theory language and \(\Sigma\) a set of sentences.
Suppose \cm is a class and \(T\vdash\cm\neq\emptyset\), then if
\(\cm\models_T\Sigma\), then
\begin{enumerate}
\item for any sentences \(\varphi\), if \(\Sigma\vdash\varphi\), then
\(T\vdash\varphi^\cm\)
\item if \(T\) is consistent, then so is \(\text{Cn}(\Sigma)\)
\end{enumerate}
\end{theorem}


\begin{theorem}[]
The axiom of foundation is consistent with \zfm.
\end{theorem}

\begin{proof}
By \ref{7.5.2}, let T be \zfm, \(\Sigma\) be \zf and \cm be \wf
\end{proof}

\begin{lemma}[$\zfmm$]
Suppose transitive model \(\cmm\models\zfmm-\text{Pow}-\text{Inf}\). If
\(X,R\in\cm\) and \(R\) is a well-order on \(X\), then
\begin{equation*}
(R\text{ is a well-order on }X)^\cmm
\end{equation*}
\end{lemma}

\begin{theorem}[$\zfmm$]
\(V_\omega\models\zfc-\text{Inf}+\neg\text{Inf}\)
\end{theorem}
\begin{proof}
For any \(X\in V_\omega\), \(X\) is finite hence there is a well-ordering on \(X\)
\end{proof}

\begin{corollary}
$\con{\zfmm}\to\con{\zfc-\text{Inf}+\neg\text{Inf}}$
\end{corollary}
