books/settheory.org
** Induction and recursion based on well-order relation
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   $\bR$ is a well-founded relation on $\bX$ if and only if
   \begin{equation*}
   \forall U\subset\bX(U\neq\emptyset\to\exists y\in U(\neg\exists z\in U(z\bR y)))
   \end{equation*}
   #+END_definition


   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   Relation $\bR$ is \tf{set-like} on $\bX$ iff for any $x\in\bX$,\par
   $\{y\in\bX\mid y\bR x\}$ is a set
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   If $\bR$ is a set-like relation on $\bX$ and $x\in \bX$, define
   \begin{align*}
   \pred^0(\bX,x,\bR)&=\{y\in\bX\mid y\bR x\}\\
   \pred^{n+1}(\bX,x,bR)&=\bigcup\{\pred(\bX,y,\bR)\mid y\in\pred^n(\bX,x,\bR)\}\\
   \cl(\bX,x,\bR)&=\displaystyle\bigcup_{n\in\omega}\pred^n(\bX,x,\bR)
   \end{align*}
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If $\bR$ is a set-like relation on $\bX$, then for any $y\in\cl(\bX,x,\bR)$,
   $\pred(\bX,y,\bR)\subseteq\cl(\bX,x,\bR)$
   #+END_lemma

   #+ATTR_LATEX: :options [Induction on well-founded set-like relation]
   #+BEGIN_theorem
   If $\bR$ is a well-founded set-like relation on $\bX$, then every nonempty 
   $\bY\subseteq\bX$ has minimal element under $\bR$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   Suppose $\bR$ is a well-founded set-like relation on $\bX$. If 
   $\bF:\bX\times\bV\to\bV$, then there is a unique $\bG:\bX\to\bV$ s.t.
   \begin{equation*}
   \forall x\in\bX(\bG(x)=\bF(x,\bG\restriction\pred(\bX,x,\bR)))
   \end{equation*}
   #+END_theorem
   
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   If $\bR$ is a set-like well-founded relation on $\bX$, define 
   \begin{equation*}
   \rank(x,\bX,\bR)=\sup\{\rank(y,\bX,\bR)+1\mid y\bR x\wedge y\in\bX\}
   \end{equation*}
   #+END_definition

   Note that
   \begin{equation*}
   \bF(x,h)=\sup\{\alpha+1\mid\alpha\in\ran{h}\}
   \end{equation*}

   #+ATTR_LATEX: :options [$\zfmm$]
   #+BEGIN_lemma
   If $\bX$ is transitive and $\in$ is well-founded on $\bX$, then
   $\bX\subseteq\wf$ and for any $x\in\bX$, $\rank(x,\bX,\in)=\rank(x)$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   $\bR$ is a set-like well-founded relation on $\bX$, \tf{Mostowski function}
   $\bG$ on $(\bX,\bR)$ is 
   \begin{equation*}
   \bG(x)=\{\bG(y)\mid y\in\bX\wedge y\bR x\}
   \end{equation*}
   $\cmm=\ran{\bG}$ is called the \tf{Mostowski collapse} of $(\bX,\bR)$
   #+END_definition
   
   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   1. $\forall x,y\in\bX(x\bR y\to\bG(x)\in\bG(y))$
   2. \cm is transitive
   3. If the axiom of power set holds, $\cm\subseteq\wf$
   4. if the axiom of power set holds and $x\in\bX$, then\par
      $\rank(x,\bX,\bR)=\rank(\bG(x))$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   $\bR$ is extensional on $\bX$ iff
   \begin{equation*}
   \forall x,y\in\bX(\forall z\in\bX(z\bR x\leftrightarrow z\bR y)\to x=y)
   \end{equation*}
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If $\bX$ is transitive then $\in$ is extensional on $\bX$
   #+END_lemma


   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   Let $\bR$ be a set-like well-founded relation on $\bX$, $\bG$ is a Mostowski
   function on it. If $\bR$ is extensional, then $\bG$ is an isomorphism
   #+END_lemma

   #+ATTR_LATEX: :options [Mostowski collapse theorem]
   #+BEGIN_theorem
   Suppose $\bR$ is set-like well-founded extensional on $\bX$, then there are
   unique transitive class \cm and bijection $\bG:\bX\to\cm$ s.t. 
   $\bG:(\bX,\bR)\cong(\cm,\in)$
   #+END_theorem
** Absoluteness under the axiom of foundation
   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   The following relations and functions can be defined by formulas in
   $\zf-\text{Pow}$ and are equivalent to some $\Delta_0$ formulas
   1. $x$ is an ordinal
   2. $x$ is a limit ordinal
   3. $x$ is a successor ordinal
   4. \omega
   5. $x$ is a finite ordinal
   6. $0,1,2,\dots,20,\dots$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem

   If transitive model $\cm\models\zf-\text{Pow}$, then every finite subset of
   \cm belongs to \cm
   #+END_theorem

   #+BEGIN_proof
   prove 
   \begin{equation*}
   \forall x\subset\cm(\abs{x}=n\to x\in\cm)
   \end{equation*}
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   The following concepts are absolute for any transitive model of
   $\zf-\text{Pow}$ 
   1. $x$ is finite
   2. $X^n$
   3. $X^{<\omega}$
   4. $R$ is a well-ordering on $X$
   5. $\text{type}(X,R)$
   6. $\alpha+1$
   7. $\alpha-1$
   8. $\alpha+\beta$
   9. $\alpha\cdot\beta$
   #+END_theorem


   Class $\bX$ is in fact a formula $\bX(x)$. It's absolute for \cm if and only
   if $\forall x\in\cm(\bX^\cm(x)\leftrightarrow\bX(x))$, which is equivalent to
   $\{x\in\cm\mid\bX(x)\}=\{x\in\cm\mid\bX^\cm(x)\}$. Hence $\bX$ is absolute
   for \cm if and only if $\bX^\cm=\cm\cap\bX$

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   Suppose $\bR$ is a well-founded set-like relation on $\bX$,
   $\bF:\bX\times\bV\to\bV$,
   \begin{equation*}
   \forall x\in\bX(\bG(x)=\bF(x,\bG\restriction(\bX,x,\bR)))
   \end{equation*}
   transitive model $\cm\models\zf-\text{Pow}$ and
   1. $\bF$ is absolute for \cm
   2. $\bX,\bR$ are absolute for \cm, $(\bR\text{ is set-like on }\bX)^\cm$ and
      \begin{equation*}
      \forall x\in\cm(\pred(\bX,x,\bR)\subseteq\cm)
      \end{equation*}

      
   then $\bG$ is absolute for $\cm$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   The following concept is absolute for any transitive model of
   $\zf-\text{Pow}$
   1. $\alpha^\beta$
   2. $\rank(x)$
   3. $\trcl{x}$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   transitive $\cm\models\zf$
   1. if $x\in\cm$, then $\calp^\cm(x)=\calp(x)\cap\cm$
   2. if $\alpha\in\cm$, then $V_\alpha^\cm=V_\alpha\cap\cm$
   #+END_lemma
