latex/settheory/SetTheory.tex
\subsection{Induction and recursion based on well-order relation}
\label{sec:org9437a6b}
\begin{definition}[]
\(\bR\) is a well-founded relation on \(\bX\) if and only if
\begin{equation*}
\forall U\subset\bX(U\neq\emptyset\to\exists y\in U(\neg\exists z\in U(z\bR y)))
\end{equation*}
\end{definition}


\begin{definition}[]
Relation \(\bR\) is \tf{set-like} on \(\bX\) iff for any \(x\in\bX\),\par
\(\{y\in\bX\mid y\bR x\}\) is a set
\end{definition}

\begin{definition}[]
If \(\bR\) is a set-like relation on \(\bX\) and \(x\in \bX\), define
\begin{align*}
\pred^0(\bX,x,\bR)&=\{y\in\bX\mid y\bR x\}\\
\pred^{n+1}(\bX,x,bR)&=\bigcup\{\pred(\bX,y,\bR)\mid y\in\pred^n(\bX,x,\bR)\}\\
\cl(\bX,x,\bR)&=\displaystyle\bigcup_{n\in\omega}\pred^n(\bX,x,\bR)
\end{align*}
\end{definition}

\begin{lemma}[]
If \(\bR\) is a set-like relation on \(\bX\), then for any \(y\in\cl(\bX,x,\bR)\),
\(\pred(\bX,y,\bR)\subseteq\cl(\bX,x,\bR)\)
\end{lemma}

\begin{theorem}[Induction on well-founded set-like relation]
If \(\bR\) is a well-founded set-like relation on \(\bX\), then every nonempty 
\(\bY\subseteq\bX\) has minimal element under \(\bR\)
\end{theorem}

\begin{theorem}[]
Suppose \(\bR\) is a well-founded set-like relation on \(\bX\). If 
\(\bF:\bX\times\bV\to\bV\), then there is a unique \(\bG:\bX\to\bV\) s.t.
\begin{equation*}
\forall x\in\bX(\bG(x)=\bF(x,\bG\restriction\pred(\bX,x,\bR)))
\end{equation*}
\end{theorem}

\begin{definition}[]
If \(\bR\) is a set-like well-founded relation on \(\bX\), define 
\begin{equation*}
\rank(x,\bX,\bR)=\sup\{\rank(y,\bX,\bR)+1\mid y\bR x\wedge y\in\bX\}
\end{equation*}
\end{definition}

Note that
\begin{equation*}
\bF(x,h)=\sup\{\alpha+1\mid\alpha\in\ran{h}\}
\end{equation*}

\begin{lemma}[$\zfmm$]
If \(\bX\) is transitive and \(\in\) is well-founded on \(\bX\), then
\(\bX\subseteq\wf\) and for any \(x\in\bX\), \(\rank(x,\bX,\in)=\rank(x)\)
\end{lemma}

\begin{definition}[]
\(\bR\) is a set-like well-founded relation on \(\bX\), \tf{Mostowski function}
\(\bG\) on \((\bX,\bR)\) is 
\begin{equation*}
\bG(x)=\{\bG(y)\mid y\in\bX\wedge y\bR x\}
\end{equation*}
\(\cmm=\ran{\bG}\) is called the \tf{Mostowski collapse} of \((\bX,\bR)\)
\end{definition}

\begin{lemma}[]
\begin{enumerate}
\item \(\forall x,y\in\bX(x\bR y\to\bG(x)\in\bG(y))\)
\item \cm is transitive
\item If the axiom of power set holds, \(\cm\subseteq\wf\)
\item if the axiom of power set holds and \(x\in\bX\), then\par
\(\rank(x,\bX,\bR)=\rank(\bG(x))\)
\end{enumerate}
\end{lemma}

\begin{definition}[]
\(\bR\) is extensional on \(\bX\) iff
\begin{equation*}
\forall x,y\in\bX(\forall z\in\bX(z\bR x\leftrightarrow z\bR y)\to x=y)
\end{equation*}
\end{definition}

\begin{lemma}[]
If \(\bX\) is transitive then \(\in\) is extensional on \(\bX\)
\end{lemma}


\begin{lemma}[]
Let \(\bR\) be a set-like well-founded relation on \(\bX\), \(\bG\) is a Mostowski
function on it. If \(\bR\) is extensional, then \(\bG\) is an isomorphism
\end{lemma}

\begin{theorem}[Mostowski collapse theorem]
Suppose \(\bR\) is set-like well-founded extensional on \(\bX\), then there are
unique transitive class \cm and bijection \(\bG:\bX\to\cm\) s.t. 
\(\bG:(\bX,\bR)\cong(\cm,\in)\)
\end{theorem}
\subsection{Absoluteness under the axiom of foundation}
\label{sec:org263eabc}
\begin{theorem}[]
The following relations and functions can be defined by formulas in
\(\zf-\text{Pow}\) and are equivalent to some \(\Delta_0\) formulas
\begin{enumerate}
\item \(x\) is an ordinal
\item \(x\) is a limit ordinal
\item \(x\) is a successor ordinal
\item \(\omega\)
\item \(x\) is a finite ordinal
\item \(0,1,2,\dots,20,\dots\)
\end{enumerate}
\end{theorem}

\begin{theorem}[]


If transitive model \(\cm\models\zf-\text{Pow}\), then every finite subset of
\cm belongs to \cm
\end{theorem}

\begin{proof}
prove 
\begin{equation*}
\forall x\subset\cm(\abs{x}=n\to x\in\cm)
\end{equation*}
\end{proof}

\begin{theorem}[]
The following concepts are absolute for any transitive model of
\(\zf-\text{Pow}\) 
\begin{enumerate}
\item \(x\) is finite
\item \(X^n\)
\item \(X^{<\omega}\)
\item \(R\) is a well-ordering on \(X\)
\item \(\text{type}(X,R)\)
\item \(\alpha+1\)
\item \(\alpha-1\)
\item \(\alpha+\beta\)
\item \(\alpha\cdot\beta\)
\end{enumerate}
\end{theorem}


Class \(\bX\) is in fact a formula \(\bX(x)\). It's absolute for \cm if and only
if \(\forall x\in\cm(\bX^\cm(x)\leftrightarrow\bX(x))\), which is equivalent to
\(\{x\in\cm\mid\bX(x)\}=\{x\in\cm\mid\bX^\cm(x)\}\). Hence \(\bX\) is absolute
for \cm if and only if \(\bX^\cm=\cm\cap\bX\)

\begin{theorem}[]
Suppose \(\bR\) is a well-founded set-like relation on \(\bX\),
\(\bF:\bX\times\bV\to\bV\),
\begin{equation*}
\forall x\in\bX(\bG(x)=\bF(x,\bG\restriction(\bX,x,\bR)))
\end{equation*}
transitive model \(\cm\models\zf-\text{Pow}\) and
\begin{enumerate}
\item \(\bF\) is absolute for \cm
\item \(\bX,\bR\) are absolute for \cm, \((\bR\text{ is set-like on }\bX)^\cm\) and
\begin{equation*}
\forall x\in\cm(\pred(\bX,x,\bR)\subseteq\cm)
\end{equation*}
\end{enumerate}


then \(\bG\) is absolute for \(\cm\)
\end{theorem}

\begin{theorem}[]
The following concept is absolute for any transitive model of
\(\zf-\text{Pow}\)
\begin{enumerate}
\item \(\alpha^\beta\)
\item \(\rank(x)\)
\item \(\trcl{x}\)
\end{enumerate}
\end{theorem}

\begin{lemma}[]
transitive \(\cm\models\zf\)
\begin{enumerate}
\item if \(x\in\cm\), then \(\calp^\cm(x)=\calp(x)\cap\cm\)
\item if \(\alpha\in\cm\), then \(V_\alpha^\cm=V_\alpha\cap\cm\)
\end{enumerate}
\end{lemma}
