books/settheory.org
** Unaccessible cardinal and models of \zfc
   $\bZ=\zff-\text{Rep},\zfmm=\zfcm-\text{Rep}$
   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   If $\gamma>\omega$ is a limit ordinal, then $V_\gamma\models_{\zff}\bZ$ and 
   $V_\gamma\models_{\zfcm}\zc$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   $V_{\omega+\omega}$ doesn't satisfies the axiom of replacement
   #+END_corollary

   #+BEGIN_proof
   
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   $\zcm\not\vdash\exists x(x=V_\omega),\zcm\not\vdash\forall x\exists y(\trcl{x}=y)$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   If \kappa is an inaccessible cardinal, then $V_\kappa\models_{\zfmm}\zff$,\par
   $V_\kappa\models_{\zfcc}\zfc$
   #+END_theorem

   #+BEGIN_proof
   Since \kappa is inaccessible, $\abs{V_\kappa}=\kappa$. For any $A\in
   V_\kappa$, $\abs{A}<\kappa$. Since \kappa is regular, any 
   $f:A\to V_\kappa$ is bounded. Hence there exists $\alpha<\kappa$ s.t. 
   $\ran{f}\subseteq V_\alpha$
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   We cannot prove "there is some inaccessible cardinals" in \zfc
   #+END_corollary

   #+BEGIN_proof
   Suppose we could. Then we have $V_\kappa\models\zfc$, which contradicts
   Gödel’s second incompleteness theorem 
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   Suppose \kappa is inaccessible. The following concepts are absolute for
   $V_\kappa$ 
   1. $x$ is a cardinal
   2. $x$ is a regular cardinal
   3. $x$ is an inaccessible cardinal
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   $\con(\zfcm)\to\con(\zfcm+\text{"there is no inaccessible cardinal"})$
   #+END_lemma

   #+BEGIN_proof
   If \kappa is the smallest inaccessible cardinal, then \par
   $V_\kappa\models\zfcm+\text{"there is no inaccessible cardinal"}$. Define
   \begin{equation*}
   \cm=\bigcap\{V_\kappa\mid\kappa\text{ is inaccessible}\}
   \end{equation*}
   #+END_proof
   If there are, then $\cm=V_\kappa$

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   \con(\zfcm)\not\to\con(\zfcm+\text{"there are some inaccessible cardinals"})
   #+END_corollary

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   For any infinite cardinal \kappa, $H_\kappa=\{x\mid\abs{\trcl{x}}<\kappa\}$
   is the collection of sets which \tf{hereditarily have size less than } \kappa.
   Element of $H_\omega$ is called \tf{hereditarily finite set}. Element of
   $H_{\omega_1}$ is called \tf{hereditarily countable set}
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   For any infinite cardinal \kappa, $H_\kappa\subseteq V_\kappa$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If \kappa is regular, then $H_\kappa=V_\kappa$ if and only if \kappa is
   inaccessible
   #+END_lemma

   #+BEGIN_proof
   which implies $\abs{V_\kappa}=\kappa$
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   For any infinite cardinal \kappa
   1. $H_\kappa$ is transitive
   2. $H_\kappa\cap\on=\kappa$
   3. If $x\in H_\kappa$, then $\bigcup x\in H_\kappa$
   4. If $x,y\in H_\kappa$, then $\{x,y\}\in H_\kappa$
   5. If $x\in H_\kappa,y\subseteq x$, then $y\in H_\kappa$
   6. if $\kappa$ is regular, then $\forall x(x\in H_\kappa\leftrightarrow
      x\subset H_\kappa\wedge\abs{x}<\kappa)$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   If \kappa is uncountable regular cardinal, then
   $H_\kappa\models_{\zfcm}\zfcm-\text{Pow}$ 
   #+END_theorem
   
   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   If \kappa is uncountable regular cardianl, then the following propositions
   are equivalent
   1. $H_\kappa\models\zfcm$
   2. $H_\kappa=V_\kappa$
   3. $\kappa$ is inaccessible
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   $\con(\zfcm)\to\con(\zfcm-\text{pow}+\forall x(x\text{ is countable}))$
   #+END_corollary
** Reflection theorem
   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   $\cm\subseteq\cn$ are classes. $\varphi_1,\dots,\varphi_n$ is a sequence
   closed under subformula, then the following propositions are equivalent
   1. $\varphi_1,\dots,\varphi_n$ are absolute for \cm and \cn
   2. if $\varphi_i=\exists\varphi_j(x,y_1,\dots,y_m)$, then
      \begin{equation*}
      \forall y_1,\dots,y_m\in\cm(\exists x\in\cn\varphi_j^\cn(x,y_1,\dots,y_m)
      \to\exists x\in\cm\varphi_j^\cm(x,y_1,\dots,y_m))
      \end{equation*}
   #+END_lemma
   
   #+ATTR_LATEX: :options [reflection theorem(\zff)]
   #+BEGIN_theorem
   For any finite formula set $F=\{\varphi_1,\dots,\varphi_n\}$, for any
   $V_\alpha$, there exists $V_\beta$ s.t. $V_\alpha\subseteq V_\beta$ and 
   $\varphi_1,\dots,\varphi_n$ are absolute for $V_\beta$
   #+END_theorem

   #+ATTR_LATEX: :options [\zff]
   #+BEGIN_corollary
   $F=\{\sigma_1,\dots,\sigma_n\}$ are finite subsets of \zf, then
   \begin{equation*}
   \forall\alpha\exists\beta>\alpha(\sigma_1^{V_\beta}\wedge\dots\wedge\sigma_n^{V_\beta})
   \end{equation*}
   #+END_corollary

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   $F=\{\sigma_1,\dots,\sigma_n\}$ is a finite subset of \zf. Unless \zf is
   unconsistent, $F$ cannot prove all axioms of \zf
   #+END_corollary

   #+ATTR_LATEX: :options [\zfcm]
   #+BEGIN_theorem
   For any finite formula set $F=\{\varphi_1,\dots,\varphi_n\}$, for any set
   $N$, there exists set $M$ s.t.
   1. $N\subseteq M$
   2. $\varphi_1,\dots,\varphi_n$ are absolute for $(M,\in)$
   3. $\abs{M}\le\abs{N}\cdot\omega$
   #+END_theorem

   #+ATTR_LATEX: :options [\zfcm]
   #+BEGIN_corollary
   For any finite formula set $F=\{\varphi_1,\dots,\varphi_n\}$, for any set
   $N$, there exists set $M$ s.t.
   1. $N\subseteq M$
   2. $\varphi_1,\dots,\varphi_n$ are absolute for $(M,\in)$
   3. $\abs{M}\le\abs{N}\cdot\omega$
   4. $M$ is transitive
   #+END_corollary
   \newpage
* Constructable Set - Venlafaxine
