latex/settheory/SetTheory.tex
\subsection{Unaccessible cardinal and models of \zfc}
\label{sec:orga351d8a}
\(\bZ=\zff-\text{Rep},\zfmm=\zfcm-\text{Rep}\)
\begin{theorem}[]
If \(\gamma>\omega\) is a limit ordinal, then \(V_\gamma\models_{\zff}\bZ\) and 
\(V_\gamma\models_{\zfcm}\zc\)
\end{theorem}

\begin{corollary}[]
\(V_{\omega+\omega}\) doesn't satisfies the axiom of replacement
\end{corollary}

\begin{proof}
   
\end{proof}

\begin{theorem}[]
\(\zcm\not\vdash\exists x(x=V_\omega),\zcm\not\vdash\forall x\exists y(\trcl{x}=y)\)
\end{theorem}

\begin{theorem}[]
If \(\kappa\) is an inaccessible cardinal, then \(V_\kappa\models_{\zfmm}\zff\),\par
\(V_\kappa\models_{\zfcc}\zfc\)
\end{theorem}

\begin{proof}
Since \(\kappa\) is inaccessible, \(\abs{V_\kappa}=\kappa\). For any \(A\in
   V_\kappa\), \(\abs{A}<\kappa\). Since \(\kappa\) is regular, any 
\(f:A\to V_\kappa\) is bounded. Hence there exists \(\alpha<\kappa\) s.t. 
\(\ran{f}\subseteq V_\alpha\)
\end{proof}

\begin{corollary}[]
We cannot prove "there is some inaccessible cardinals" in \zfc
\end{corollary}

\begin{proof}
Suppose we could. Then we have \(V_\kappa\models\zfc\), which contradicts
Gödel’s second incompleteness theorem 
\end{proof}

\begin{lemma}[]
Suppose \(\kappa\) is inaccessible. The following concepts are absolute for
\(V_\kappa\) 
\begin{enumerate}
\item \(x\) is a cardinal
\item \(x\) is a regular cardinal
\item \(x\) is an inaccessible cardinal
\end{enumerate}
\end{lemma}

\begin{lemma}[]
\(\con(\zfcm)\to\con(\zfcm+\text{"there is no inaccessible cardinal"})\)
\end{lemma}

\begin{proof}
If \(\kappa\) is the smallest inaccessible cardinal, then \par
\(V_\kappa\models\zfcm+\text{"there is no inaccessible cardinal"}\). Define
\begin{equation*}
\cm=\bigcap\{V_\kappa\mid\kappa\text{ is inaccessible}\}
\end{equation*}
\end{proof}
If there are, then \(\cm=V_\kappa\)

\begin{corollary}[]
\con(\zfcm)\textlnot{}\(\to\)\con(\zfcm+\text{"there are some inaccessible cardinals"})
\end{corollary}

\begin{definition}[]
For any infinite cardinal \(\kappa\), \(H_\kappa=\{x\mid\abs{\trcl{x}}<\kappa\}\)
is the collection of sets which \tf{hereditarily have size less than } \(\kappa\).
Element of \(H_\omega\) is called \tf{hereditarily finite set}. Element of
\(H_{\omega_1}\) is called \tf{hereditarily countable set}
\end{definition}

\begin{lemma}[]
For any infinite cardinal \(\kappa\), \(H_\kappa\subseteq V_\kappa\)
\end{lemma}

\begin{lemma}[]
If \(\kappa\) is regular, then \(H_\kappa=V_\kappa\) if and only if \(\kappa\) is
inaccessible
\end{lemma}

\begin{proof}
which implies \(\abs{V_\kappa}=\kappa\)
\end{proof}

\begin{lemma}[]
For any infinite cardinal \(\kappa\)
\begin{enumerate}
\item \(H_\kappa\) is transitive
\item \(H_\kappa\cap\on=\kappa\)
\item If \(x\in H_\kappa\), then \(\bigcup x\in H_\kappa\)
\item If \(x,y\in H_\kappa\), then \(\{x,y\}\in H_\kappa\)
\item If \(x\in H_\kappa,y\subseteq x\), then \(y\in H_\kappa\)
\item if \(\kappa\) is regular, then \(\forall x(x\in H_\kappa\leftrightarrow
      x\subset H_\kappa\wedge\abs{x}<\kappa)\)
\end{enumerate}
\end{lemma}

\begin{theorem}[]
If \(\kappa\) is uncountable regular cardinal, then
\(H_\kappa\models_{\zfcm}\zfcm-\text{Pow}\) 
\end{theorem}

\begin{theorem}[]
If \(\kappa\) is uncountable regular cardianl, then the following propositions
are equivalent
\begin{enumerate}
\item \(H_\kappa\models\zfcm\)
\item \(H_\kappa=V_\kappa\)
\item \(\kappa\) is inaccessible
\end{enumerate}
\end{theorem}

\begin{corollary}[]
\(\con(\zfcm)\to\con(\zfcm-\text{pow}+\forall x(x\text{ is countable}))\)
\end{corollary}
\subsection{Reflection theorem}
\label{sec:org47915f2}
\begin{lemma}[]
\(\cm\subseteq\cn\) are classes. \(\varphi_1,\dots,\varphi_n\) is a sequence
closed under subformula, then the following propositions are equivalent
\begin{enumerate}
\item \(\varphi_1,\dots,\varphi_n\) are absolute for \cm and \cn
\item if \(\varphi_i=\exists\varphi_j(x,y_1,\dots,y_m)\), then
\begin{equation*}
\forall y_1,\dots,y_m\in\cm(\exists x\in\cn\varphi_j^\cn(x,y_1,\dots,y_m)
\to\exists x\in\cm\varphi_j^\cm(x,y_1,\dots,y_m))
\end{equation*}
\end{enumerate}
\end{lemma}

\begin{theorem}[reflection theorem(\zff)]
For any finite formula set \(F=\{\varphi_1,\dots,\varphi_n\}\), for any
\(V_\alpha\), there exists \(V_\beta\) s.t. \(V_\alpha\subseteq V_\beta\) and 
\(\varphi_1,\dots,\varphi_n\) are absolute for \(V_\beta\)
\end{theorem}

\begin{corollary}[\zff]
\(F=\{\sigma_1,\dots,\sigma_n\}\) are finite subsets of \zf, then
\begin{equation*}
\forall\alpha\exists\beta>\alpha(\sigma_1^{V_\beta}\wedge\dots\wedge\sigma_n^{V_\beta})
\end{equation*}
\end{corollary}

\begin{corollary}[]
\(F=\{\sigma_1,\dots,\sigma_n\}\) is a finite subset of \zf. Unless \zf is
unconsistent, \(F\) cannot prove all axioms of \zf
\end{corollary}

\begin{theorem}[\zfcm]
For any finite formula set \(F=\{\varphi_1,\dots,\varphi_n\}\), for any set
\(N\), there exists set \(M\) s.t.
\begin{enumerate}
\item \(N\subseteq M\)
\item \(\varphi_1,\dots,\varphi_n\) are absolute for \((M,\in)\)
\item \(\abs{M}\le\abs{N}\cdot\omega\)
\end{enumerate}
\end{theorem}

\begin{corollary}[\zfcm]
For any finite formula set \(F=\{\varphi_1,\dots,\varphi_n\}\), for any set
\(N\), there exists set \(M\) s.t.
\begin{enumerate}
\item \(N\subseteq M\)
\item \(\varphi_1,\dots,\varphi_n\) are absolute for \((M,\in)\)
\item \(\abs{M}\le\abs{N}\cdot\omega\)
\item \(M\) is transitive
\end{enumerate}
\end{corollary}
\newpage
\section{Constructable Set - Venlafaxine}
\label{sec:orgd490fb2}
