books/settheory.org
** Definablity and Gödel operation
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   $M$ is a set, $\psi(x_1,\dots,x_n,y_1,\dots,y_m)$ is a formula, 
   $X\subseteq M^n$ is \tf{definable in $M$ from parameters from $\psi$} if and
   only if there are $y_1,\dots,y_m\in M$ s.t.
   \begin{equation*}
   X=\{(x_1,\dots,x_n)\mid(\psi^M(x_1,\dots,x_n,y_1,\dots,y_m))\}
   \end{equation*}
   \begin{equation*}
   \deff(M)=\{X\subseteq M\mid\exists\psi,X\text{ is definable in } 
   M \text{ from } \psi\} 
   \end{equation*}
   #+END_definition
   
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   \tf{Gödel operation}
   1. $G_1(X,Y)=\{X,Y\}$
   2. $G_2(X,Y)=X\times Y$
   3. $G_3(X,Y)=\in\restriction X\times Y$
   4. $G_4(X,Y)=X-Y$
   5. $G_5(X,Y)=X\cap Y$
   6. $G_6(X,Y)=\bigcap X$
   7. $G_7(X,Y)=\dom{X}$
   8. $G_8(X,Y)=\{(x,y)\mid(y,x)\in X\}$
   9. $G_9(X,Y)=\{(x,y,z)\mid(x,z,y)\in X\}$
   10. $G_{10}(X,Y)=\{(x,y,z)\mid(y,z,x)\in X\}$

       
   Class $C$ is closed under Gödel operation if for any $X,Y$, X,Y\in C$ implies
   $G_i(X,Y)\in C$. For any set $M$, $\cl_G(M)$ is the 
   \tf{closure under Gödel operation}
 
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   \psi is a \tf{normal form} if
   1. only $\neg,\wedge,\exists$ are logical symbol
   2. = doesn't appear
   3. if $x_i\in x_j$ then $i\neq j$
   4. $\exists$ only shown as: $\exists x_{m+1}\in
      x_i\varphi(x_1,\dots,x_{m+1})$, $1\le i\le m$
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   Any $\Delta_0$ formula can be transformed into normal form
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   For any $\Delta_0$ formula $\psi(x_1,\dots,x_n)$, there is Gödel operations'
   composition $G$ s.t. for any $X_1,\dots,X_n$
   \begin{align*}
   G(X_1,\dots,X_n)=&\{(x_1,\dots,x_n)\mid\\
   &x_1\in X_1\wedge\dots\wedge x_n\in X_n\wedge\psi(x_1,\dots,x_n)\}
   \end{align*}
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   If $M$ is transitive and $M=\cl_G(M)$, then for any $\Delta_0$ formula
   $\psi(x,y_1,\dots,y_m)$, any set $X\in M$, any $y_1,\dots,y_m\in M$ if
   \begin{equation*}
   Y=\{x\in X\mid\psi(x,y_1,\dots,y_m)\}
   \end{equation*}
   then $Y\in M$. Hence $\Delta_0$ schema of specification holds in $M$
   #+END_corollary

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If $G(X_1,\dots,X_n)$ is Gödel operations' composition, then
   $Z=G(X_1,\dots,X_n)$ is equivalent to a $\Delta_0$ formula
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   For any transitive set $M$, $\deff(M)=\cl_G(M\cup\{M\})\cap\calp(M)$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If transitive $\cm\models\zff$, then for any transitive set $M\in\cm$,
   $\deff(M)$ is absolute for \cm
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   For any transitive set $M$
   1. $\deff(M)\subseteq\calp(M)$
   2. $M\subseteq \deff(M)$
   3. for any $X\subseteq M$, if $X$ is finite, then $X\in\deff(M)$
   4. assume $\ac$ and $\abs{M}\ge\omega$, then $\abs{\deff(M)}=\abs{M}$
   #+END_lemma
** Gödel's L
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   for any \alpha
   1. $L_0=\emptyset$
   2. $L_{\alpha+1}=\deff(L_\alpha)$
   3. For any limit \alpha, $L_\alpha=\bigcup_{\beta<\alpha}L_\beta$


   $\textbf{L}=\displaystyle\bigcup_{\alpha\in\on}L_\alpha$. Element of \gl is
   called constructible set
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   For any ordinal \alpha
   1. $L_\alpha$ is transitive
   2. If $\alpha<\beta$, then $L_\alpha\subseteq L_\beta$
   3. $L_\alpha\subseteq V_\alpha$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   $x\in\gll$
   \begin{equation*}
   \rank_\gll(x)=\min\{\beta\mid x\in\gll_{\beta+1}\}
   \end{equation*}
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   For any \alpha
   \begin{equation*}
   L_\alpha=\{x\in\gll\mid\rank_{\gll}(x)<\alpha\}
   \end{equation*}
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   For any ordinal \alpha
   1. $L_\alpha\cap\on=\alpha$
   2. $\alpha\in\gll\cap\rank_{\gll}(\alpha)=\alpha$
   #+END_lemma

   #+BEGIN_proof
   since "\alpha is a cardinal" is absolute for any transitive set. 
   \begin{align*}
   \alpha&=L_\alpha\cap\on=\{\eta\in L_\alpha\mid\eta\text{ is a ordinal}\}\\
   &=\{\eta\in L_\alpha\mid(\eta\text{ is an ordinal}^{L_\alpha})\}\in\deff(L_\alpha)
   \end{align*}
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   for any ordinal \alpha
   1. $L_\alpha\in L_{\alpha+1}$
   2. any finite subset of $L_\alpha$ belongs to $L_{\alpha+1}$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   1. $\forall n\in\omega(L_n=V_n)$
   2. $L_\omega=V_\omega$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If \ac, then for any $\alpha\ge\omega,\abs{L_\alpha}=\abs{\alpha}$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   $\gll\models\zff$
   #+END_theorem

