latex/settheory/SetTheory.tex
\subsection{Definablity and Gödel operation}
\label{sec:org5d12200}
\begin{definition}[]
\(M\) is a set, \(\psi(x_1,\dots,x_n,y_1,\dots,y_m)\) is a formula, 
\(X\subseteq M^n\) is \tf{definable in $M$ from parameters from $\psi$} if and
only if there are \(y_1,\dots,y_m\in M\) s.t.
\begin{equation*}
X=\{(x_1,\dots,x_n)\mid(\psi^M(x_1,\dots,x_n,y_1,\dots,y_m))\}
\end{equation*}
\begin{equation*}
\deff(M)=\{X\subseteq M\mid\exists\psi,X\text{ is definable in } 
M \text{ from } \psi\} 
\end{equation*}
\end{definition}

\begin{definition}[]
\tf{Gödel operation}
\begin{enumerate}
\item \(G_1(X,Y)=\{X,Y\}\)
\item \(G_2(X,Y)=X\times Y\)
\item \(G_3(X,Y)=\in\restriction X\times Y\)
\item \(G_4(X,Y)=X-Y\)
\item \(G_5(X,Y)=X\cap Y\)
\item \(G_6(X,Y)=\bigcap X\)
\item \(G_7(X,Y)=\dom{X}\)
\item \(G_8(X,Y)=\{(x,y)\mid(y,x)\in X\}\)
\item \(G_9(X,Y)=\{(x,y,z)\mid(x,z,y)\in X\}\)
\item \(G_{10}(X,Y)=\{(x,y,z)\mid(y,z,x)\in X\}\)
\end{enumerate}


Class \(C\) is closed under Gödel operation if for any \(X,Y\), X,Y\(\in\) C\$ implies
\(G_i(X,Y)\in C\). For any set \(M\), \(\cl_G(M)\) is the 
\tf{closure under Gödel operation}
\end{definition}

\begin{definition}[]
\(\psi\) is a \tf{normal form} if
\begin{enumerate}
\item only \(\neg,\wedge,\exists\) are logical symbol
\item = doesn't appear
\item if \(x_i\in x_j\) then \(i\neq j\)
\item \(\exists\) only shown as: \(\exists x_{m+1}\in
      x_i\varphi(x_1,\dots,x_{m+1})\), \(1\le i\le m\)
\end{enumerate}
\end{definition}

\begin{lemma}[]
Any \(\Delta_0\) formula can be transformed into normal form
\end{lemma}

\begin{theorem}[]
For any \(\Delta_0\) formula \(\psi(x_1,\dots,x_n)\), there is Gödel operations'
composition \(G\) s.t. for any \(X_1,\dots,X_n\)
\begin{align*}
G(X_1,\dots,X_n)=&\{(x_1,\dots,x_n)\mid\\
&x_1\in X_1\wedge\dots\wedge x_n\in X_n\wedge\psi(x_1,\dots,x_n)\}
\end{align*}
\end{theorem}

\begin{corollary}[]
If \(M\) is transitive and \(M=\cl_G(M)\), then for any \(\Delta_0\) formula
\(\psi(x,y_1,\dots,y_m)\), any set \(X\in M\), any \(y_1,\dots,y_m\in M\) if
\begin{equation*}
Y=\{x\in X\mid\psi(x,y_1,\dots,y_m)\}
\end{equation*}
then \(Y\in M\). Hence \(\Delta_0\) schema of specification holds in \(M\)
\end{corollary}

\begin{lemma}[]
If \(G(X_1,\dots,X_n)\) is Gödel operations' composition, then
\(Z=G(X_1,\dots,X_n)\) is equivalent to a \(\Delta_0\) formula
\end{lemma}

\begin{theorem}[]
For any transitive set \(M\), \(\deff(M)=\cl_G(M\cup\{M\})\cap\calp(M)\)
\end{theorem}

\begin{lemma}[]
If transitive \(\cm\models\zff\), then for any transitive set \(M\in\cm\),
\(\deff(M)\) is absolute for \cm
\end{lemma}

\begin{lemma}[]
For any transitive set \(M\)
\begin{enumerate}
\item \(\deff(M)\subseteq\calp(M)\)
\item \(M\subseteq \deff(M)\)
\item for any \(X\subseteq M\), if \(X\) is finite, then \(X\in\deff(M)\)
\item assume \(\ac\) and \(\abs{M}\ge\omega\), then \(\abs{\deff(M)}=\abs{M}\)
\end{enumerate}
\end{lemma}
\subsection{Gödel's L}
\label{sec:orgdd00093}
\begin{definition}[]
for any \(\alpha\)
\begin{enumerate}
\item \(L_0=\emptyset\)
\item \(L_{\alpha+1}=\deff(L_\alpha)\)
\item For any limit \(\alpha\), \(L_\alpha=\bigcup_{\beta<\alpha}L_\beta\)
\end{enumerate}


\(\textbf{L}=\displaystyle\bigcup_{\alpha\in\on}L_\alpha\). Element of \gl is
called constructible set
\end{definition}

\begin{lemma}[]
For any ordinal \(\alpha\)
\begin{enumerate}
\item \(L_\alpha\) is transitive
\item If \(\alpha<\beta\), then \(L_\alpha\subseteq L_\beta\)
\item \(L_\alpha\subseteq V_\alpha\)
\end{enumerate}
\end{lemma}

\begin{definition}[]
\(x\in\gll\)
\begin{equation*}
\rank_\gll(x)=\min\{\beta\mid x\in\gll_{\beta+1}\}
\end{equation*}
\end{definition}

\begin{lemma}[]
For any \(\alpha\)
\begin{equation*}
L_\alpha=\{x\in\gll\mid\rank_{\gll}(x)<\alpha\}
\end{equation*}
\end{lemma}

\begin{lemma}[]
For any ordinal \(\alpha\)
\begin{enumerate}
\item \(L_\alpha\cap\on=\alpha\)
\item \(\alpha\in\gll\cap\rank_{\gll}(\alpha)=\alpha\)
\end{enumerate}
\end{lemma}

\begin{proof}
since "\(\alpha\) is a cardinal" is absolute for any transitive set. 
\begin{align*}
\alpha&=L_\alpha\cap\on=\{\eta\in L_\alpha\mid\eta\text{ is a ordinal}\}\\
&=\{\eta\in L_\alpha\mid(\eta\text{ is an ordinal}^{L_\alpha})\}\in\deff(L_\alpha)
\end{align*}
\end{proof}

\begin{lemma}[]
for any ordinal \(\alpha\)
\begin{enumerate}
\item \(L_\alpha\in L_{\alpha+1}\)
\item any finite subset of \(L_\alpha\) belongs to \(L_{\alpha+1}\)
\end{enumerate}
\end{lemma}

\begin{lemma}[]
\begin{enumerate}
\item \(\forall n\in\omega(L_n=V_n)\)
\item \(L_\omega=V_\omega\)
\end{enumerate}
\end{lemma}

\begin{lemma}[]
If \ac, then for any \(\alpha\ge\omega,\abs{L_\alpha}=\abs{\alpha}\)
\end{lemma}

\begin{theorem}[]
\(\gll\models\zff\)
\end{theorem}
