books/settheory.org
** Axiom of constructibility and relativization
   #+ATTR_LATEX: :options [Axiom of constructibility]
   #+BEGIN_theorem
   $\cvm=\gll$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   label:8.3.2
   function $\alpha\mapsto L_\alpha$ is absolute for any transitive model of \zf
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   $\gll\models\zff+\cv=\gll$
   #+END_theorem

   #+BEGIN_proof
   $(\cv=\gll)^\gll$ is $\forall x\in\gll\exists\alpha\in\gll(x\in
   L_\alpha)^\gll$. 
   By ref:8.3.2, $(x\in L_\alpha)^\gll\Leftrightarrow x\in L_\alpha$. Hence
   $\gll\models\cv=\gll$

   #+END_proof
   Hence
   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   $\con(\zff)\to\con(\zff+\cv=\gll)$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   Suppose transitive proper class $\cmm\models\zff-\text{Pow}$, then\par
   $\gll=\gll^\cmm\subseteq\cmm$ 
   #+END_theorem

   #+BEGIN_proof
   For any ordinal \alpha, since \cm is proper, $\cmm\not\subseteq V_\alpha$.
   Hence there is $x\in\cmm$ s.t. $\rank(x)\ge\alpha$. Since rank is absolute,
   $\rank(x)\in\cmm$. And \cm is transitive, hence $\alpha\in\cmm$. By
   ref:8.3.2, $L_\alpha\in\cmm$
   \begin{align*}
    \gll^\cmm &=\{x\in\cmm\mid(\exists\alpha\in\on(x\in L_\alpha))^\cmm\}\\
    &=\{x\mid\exists\alpha\in\on\cap\cmm(x\in\ L_\alpha\cap\cmm)\}\\
    &=\{x\mid\exists\alpha\in\on(x\in L_\alpha)\}\\
    &=\gll
   \end{align*}
   #+END_proof
   
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   If transitive model $\cm\models\zff$ contains all ordinals, then it's an
   \tf{inner model}
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   there is a finite set of axioms $\{\psi_1,\dots,\psi_n\}$ of
   $\zff-\text{Pow}$ s.t. ordinals,rank and $L_\alpha$ are absolute for any
   model of $\{\psi_1,\dots,\psi_n\}$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If set $M$ is transitive, then $M\cap\on$ is a ordinall and is the least that
   doesn't belong to $M$, denoted by $\alpha^M$
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   There is a finite subset $\{\psi_1,\dots,\psi_n\}$ of axioms of
   $\zff-\text{Pow}$ satisfying
   \begin{equation*}
   \forall M(M\text{ is transitive }\wedge\psi_1^M\wedge\dots\wedge\psi_n^m\to
   (L_{\alpha^M}=\gll^M\subseteq M))
   \end{equation*}
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   The is a finite subset $\{\psi_1,\dots,\psi_{n+1}\}$ of axioms of
   $\zff-\text{Pow}+\cvm=\gll$ satisfying
   1. If \cm is a transitive proper class and
      $\psi_1^\cm\wedge\dots\wedge\psi_{n+1}^\cm$, then $\cm=\gll$
   2. $\forall M(M\text{ is transitive
      }\wedge\psi_1^M\wedge\dots\wedge\psi_n^m\to (L_{\alpha^M}=M))$
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   There is a well-ordering on \gll. Hence $\cvm=\gll\to\ac$
   #+END_theorem

   If $\cvm=\gll$, hence $\aleph_\alpha\subseteq L_{\aleph_{\alpha+1}}$. Because
   $\abs{L_{\alpha_{\alpha+1}}}=\aleph_{\alpha+1}$,
   $2^{\aleph_\alpha}\le\aleph_{\alpha+1}$ 
   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   If $\cvm=\gll$, then for any infinite ordinal \alpha,
   $\calp(L_\alpha)\subseteq L_{\abs{\alpha}^+}$
   #+END_theorem

   #+ATTR_LATEX: :options [$\zff$]
   #+BEGIN_corollary
   $(\ac+\gchh)^\gll$
   #+END_corollary

   #+ATTR_LATEX: :options [$\zff$]
   #+BEGIN_theorem
   $\con(\zff)\to\con(\zfcm+\gchh)$
   #+END_theorem

   #+ATTR_LATEX: :options [$\zff$]
   #+BEGIN_theorem
   Suppose $S_0=\{\psi_1,\dots,\psi_n\}\subseteq\zff+\cvm=\gll$, then
   \begin{equation*}
   \zff\vdash\exists M(\abs{M}=\omega\wedge M\text{ is transitive}\wedge
   (\psi_1^M\wedge\dots\wedge\psi_n^M))
   \end{equation*}
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   Suppose $\cvm=\gll$. For any uncountable regular cardinal \kappa,
   $L_\kappa=H_\kappa$ 
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   If \kappa is a uncountable regular cardinal, then
   $\L_\kappa\models\zff-\text{Pow}+\cvm=\gll$. If \kappa is inaccessible, then 
   $L_\kappa\models\zff+\cvm=\gll$
   #+END_corollary

\newpage

* The end
  Learn and forget

   
