latex/settheory/SetTheory.tex

\subsection{Axiom of constructibility and relativization}
\label{sec:org1f144ed}
\begin{theorem}[Axiom of constructibility]
\(\cvm=\gll\)
\end{theorem}

\begin{lemma}[]
\label{8.3.2}
function \(\alpha\mapsto L_\alpha\) is absolute for any transitive model of \zf
\end{lemma}

\begin{theorem}[]
\(\gll\models\zff+\cv=\gll\)
\end{theorem}

\begin{proof}
\((\cv=\gll)^\gll\) is \(\forall x\in\gll\exists\alpha\in\gll(x\in
   L_\alpha)^\gll\). 
By \ref{8.3.2}, \((x\in L_\alpha)^\gll\Leftrightarrow x\in L_\alpha\). Hence
\(\gll\models\cv=\gll\)
\end{proof}
Hence
\begin{theorem}[]
\(\con(\zff)\to\con(\zff+\cv=\gll)\)
\end{theorem}

\begin{theorem}[]
Suppose transitive proper class \(\cmm\models\zff-\text{Pow}\), then\par
\(\gll=\gll^\cmm\subseteq\cmm\) 
\end{theorem}

\begin{proof}
For any ordinal \(\alpha\), since \cm is proper, \(\cmm\not\subseteq V_\alpha\).
Hence there is \(x\in\cmm\) s.t. \(\rank(x)\ge\alpha\). Since rank is absolute,
\(\rank(x)\in\cmm\). And \cm is transitive, hence \(\alpha\in\cmm\). By
\ref{8.3.2}, \(L_\alpha\in\cmm\)
\begin{align*}
 \gll^\cmm &=\{x\in\cmm\mid(\exists\alpha\in\on(x\in L_\alpha))^\cmm\}\\
 &=\{x\mid\exists\alpha\in\on\cap\cmm(x\in\ L_\alpha\cap\cmm)\}\\
 &=\{x\mid\exists\alpha\in\on(x\in L_\alpha)\}\\
 &=\gll
\end{align*}
\end{proof}

\begin{definition}[]
If transitive model \(\cm\models\zff\) contains all ordinals, then it's an
\tf{inner model}
\end{definition}

\begin{lemma}[]
there is a finite set of axioms \(\{\psi_1,\dots,\psi_n\}\) of
\(\zff-\text{Pow}\) s.t. ordinals,rank and \(L_\alpha\) are absolute for any
model of \(\{\psi_1,\dots,\psi_n\}\)
\end{lemma}

\begin{lemma}[]
If set \(M\) is transitive, then \(M\cap\on\) is a ordinall and is the least that
doesn't belong to \(M\), denoted by \(\alpha^M\)
\end{lemma}

\begin{theorem}[]
There is a finite subset \(\{\psi_1,\dots,\psi_n\}\) of axioms of
\(\zff-\text{Pow}\) satisfying
\begin{equation*}
\forall M(M\text{ is transitive }\wedge\psi_1^M\wedge\dots\wedge\psi_n^m\to
(L_{\alpha^M}=\gll^M\subseteq M))
\end{equation*}
\end{theorem}

\begin{theorem}[]
The is a finite subset \(\{\psi_1,\dots,\psi_{n+1}\}\) of axioms of
\(\zff-\text{Pow}+\cvm=\gll\) satisfying
\begin{enumerate}
\item If \cm is a transitive proper class and
\(\psi_1^\cm\wedge\dots\wedge\psi_{n+1}^\cm\), then \(\cm=\gll\)
\item \(\forall M(M\text{ is transitive
      }\wedge\psi_1^M\wedge\dots\wedge\psi_n^m\to (L_{\alpha^M}=M))\)
\end{enumerate}
\end{theorem}

\begin{theorem}[]
There is a well-ordering on \gll. Hence \(\cvm=\gll\to\ac\)
\end{theorem}

If \(\cvm=\gll\), hence \(\aleph_\alpha\subseteq L_{\aleph_{\alpha+1}}\). Because
\(\abs{L_{\alpha_{\alpha+1}}}=\aleph_{\alpha+1}\),
\(2^{\aleph_\alpha}\le\aleph_{\alpha+1}\) 
\begin{theorem}[]
If \(\cvm=\gll\), then for any infinite ordinal \(\alpha\),
\(\calp(L_\alpha)\subseteq L_{\abs{\alpha}^+}\)
\end{theorem}

\begin{corollary}[$\zff$]
\((\ac+\gchh)^\gll\)
\end{corollary}

\begin{theorem}[$\zff$]
\(\con(\zff)\to\con(\zfcm+\gchh)\)
\end{theorem}

\begin{theorem}[$\zff$]
Suppose \(S_0=\{\psi_1,\dots,\psi_n\}\subseteq\zff+\cvm=\gll\), then
\begin{equation*}
\zff\vdash\exists M(\abs{M}=\omega\wedge M\text{ is transitive}\wedge
(\psi_1^M\wedge\dots\wedge\psi_n^M))
\end{equation*}
\end{theorem}

\begin{lemma}[]
Suppose \(\cvm=\gll\). For any uncountable regular cardinal \(\kappa\),
\(L_\kappa=H_\kappa\) 
\end{lemma}

\begin{corollary}[]
If \(\kappa\) is a uncountable regular cardinal, then
\(\L_\kappa\models\zff-\text{Pow}+\cvm=\gll\). If \(\kappa\) is inaccessible, then 
\(L_\kappa\models\zff+\cvm=\gll\)
\end{corollary}

\newpage

\section{The end}
\label{sec:org468cb1b}
Learn and forget
\end{document}